#+TITLE: Free Software in Industry and Academia
#+AUTHOR: Pedro G. Branquinho
bibliography:../../bib.bib

**** The code to solve it
#+NAME: 5254a4aa-d59a-4522-80a4-50bef477a76b
#+begin_src ein-python :session localhost :results output
   from ortools.sat.python import cp_model
  
  class NursesPartialSolutionPrinter(cp_model.CpSolverSolutionCallback):
      """Print intermediate solutions."""
  
      def __init__(self, shifts, num_nurses, num_days, num_shifts, sols):
          cp_model.CpSolverSolutionCallback.__init__(self)
          self._shifts = shifts
          self._num_nurses = num_nurses
          self._num_days = num_days
          self._num_shifts = num_shifts
          self._solutions = set(sols)
          self._solution_count = 0
  
      def on_solution_callback(self):
          if self._solution_count in self._solutions:
              print('Solution %i' % self._solution_count)
              for d in range(self._num_days):
                  print('Day %i' % d)
                  for n in range(self._num_nurses):
                      is_working = False
                      for s in range(self._num_shifts):
                          if self.Value(self._shifts[(n, d, s)]):
                              is_working = True
                              print('  Nurse %i works shift %i' % (n, s))
                      if not is_working:
                          print('  Nurse {} does not work'.format(n))
              print()
          self._solution_count += 1
  
      def solution_count(self):
          return self._solution_count
  
  def main():
      # Data.
      num_nurses = 5
      num_shifts = 4
      num_days = 2
      all_nurses = range(num_nurses)
      all_shifts = range(num_shifts)
      all_days = range(num_days)
      # Creates the model.
      model = cp_model.CpModel()
  
      # Creates shift variables.
      # shifts[(n, d, s)]: nurse 'n' works shift 's' on day 'd'.
      shifts = {}
      for n in all_nurses:
          for d in all_days:
              for s in all_shifts:
                  shifts[(n, d,
                          s)] = model.NewBoolVar('shift_n%id%is%i' % (n, d, s))
  
      # Each shift is assigned to exactly one nurse in the schedule period.
      for d in all_days:
          for s in all_shifts:
              model.Add(sum(shifts[(n, d, s)] for n in all_nurses) == 1)
  
      # Each nurse works at most one shift per day.
      for n in all_nurses:
          for d in all_days:
              model.Add(sum(shifts[(n, d, s)] for s in all_shifts) <= 1)
  
      # Try to distribute the shifts evenly, so that each nurse works
      # min_shifts_per_nurse shifts. If this is not possible, because the total
      # number of shifts is not divisible by the number of nurses, some nurses will
      # be assigned one more shift.
      min_shifts_per_nurse = (num_shifts * num_days) // num_nurses
      if num_shifts * num_days % num_nurses == 0:
          max_shifts_per_nurse = min_shifts_per_nurse
      else:
          max_shifts_per_nurse = min_shifts_per_nurse + 1
      for n in all_nurses:
          num_shifts_worked = 0
          for d in all_days:
              for s in all_shifts:
                  num_shifts_worked += shifts[(n, d, s)]
          model.Add(min_shifts_per_nurse <= num_shifts_worked)
          model.Add(num_shifts_worked <= max_shifts_per_nurse)
  
      # Creates the solver and solve.
      solver = cp_model.CpSolver()
      solver.parameters.linearization_level = 0
      # Display the first five solutions.
      a_few_solutions = range(2)
      solution_printer = NursesPartialSolutionPrinter(shifts, num_nurses,
                                                      num_days, num_shifts,
                                                      a_few_solutions)
      solver.SearchForAllSolutions(model, solution_printer)
  
      # Statistics.
      print()
      print('Statistics')
      print('  - conflicts       : %i' % solver.NumConflicts())
      print('  - branches        : %i' % solver.NumBranches())
      print('  - wall time       : %f s' % solver.WallTime())
      print('  - solutions found : %i' % solution_printer.solution_count())
  
  
  if __name__ == '__main__':
      main() 
#+end_src

#+RESULTS: 5254a4aa-d59a-4522-80a4-50bef477a76b
#+begin_example
Solution 0
Day 0
  Nurse 0 does not work
  Nurse 1 works shift 2
  Nurse 2 works shift 3
  Nurse 3 works shift 1
  Nurse 4 works shift 0
Day 1
  Nurse 0 works shift 3
  Nurse 1 works shift 2
  Nurse 2 works shift 1
  Nurse 3 works shift 0
  Nurse 4 does not work

Solution 1
Day 0
  Nurse 0 works shift 2
  Nurse 1 does not work
  Nurse 2 works shift 3
  Nurse 3 works shift 1
  Nurse 4 works shift 0
Day 1
  Nurse 0 works shift 3
  Nurse 1 works shift 2
  Nurse 2 works shift 1
  Nurse 3 works shift 0
  Nurse 4 does not work


Statistics
  - conflicts       : 17
  - branches        : 100376
  - wall time       : 0.367541 s
  - solutions found : 11520
#+end_example

***** Create a mechanism to represent the rules and values on canvas 
     #+begin_src clojure
       (defn make-rule
	 "Create rule table based on Celular Automata (C.A.) number."
	 [^long id]
	 (mapv
	  #(if (zero? (bit-and id (bit-shift-left 1 ^long %)))
	     0
	     1)
	  (range 7 -1 -1)))
     #+end_src

     #+begin_src clojure
       (defn apply-rule
	 "Create rule number from `a`, `b`, `c`, parameters (values 0 or 1)
	 and return result from rule table."
	 [rule a b c]
	 (let [s (str a b c)
	       idx (Integer/parseInt s 2)]
	   (rule idx)))
     #+end_src

     #+begin_src clojure
       (defn init-cells
	 "Create first line with one single seed in the middle"
	 [^long size]
	 (mapv
	  #(if (== ^long % (m/floor (/ size 2)))
	     1
	     0)
	  (range size)))
     #+end_src

     #+RESULTS:
     : #'examples.NOC.ch07.wolframca-figures-7-1/init-cells

     #+begin_src clojure
       (defn next-cells
	 "Calculate next line based on previous and rule, wrap result."
	 [cells rule]
	 (let [s (count cells)]
	   (mapv
	    #(let [^long v %                 
		   [l r] (if wrap?
			   [(cells (int (m/wrap 0 s (dec v))))
			    (cells (int (m/wrap 0 s (inc v))))]
			   [(if (zero? v) 0 (cells (dec v)))
			    (if (< v (dec s)) (cells (inc v)) 0)])]
	       (apply-rule rule l (cells v) r)) (range s))))
     #+end_src

     #+RESULTS:
     : #'examples.NOC.ch07.wolframca-figures-7-1/next-cells

     #+begin_src clojure
       (defn draw-cells
	 "Draw cells."
	 [canvas rule]
	 (loop [cells (init-cells cell-no)
		row (int 0)]
	   (when (< row rows)      
	     (dotimes [x cell-no]
	       (if (== ^int (cells x) 1)
		 (set-color canvas :black)
		 (set-color canvas :white))
	       (rect canvas (* x scl) (* row scl) scl scl)
	       (set-color canvas :black)
	       (rect canvas (* x scl) (* row scl) scl scl true))
	     (recur (next-cells cells rule)
		    (inc row)))))
     #+end_src

     #+RESULTS:
     : #'examples.NOC.ch07.wolframca-figures-7-1/draw-cells

     #+begin_src clojure
 (def cnvs (canvas w h))
 (def window (show-window cnvs "Wolframca figures 7_1"))
     #+end_src

     #+RESULTS:

     #+begin_src clojure
       (defn draw-rule
	 "Two cases. Empty or with a rule."
	 ([] (draw-rule (r/irand 256))) 
	 ([rule]
	  (println (str "Rule: " rule))
	  (with-canvas-> cnvs
	    (draw-cells (make-rule rule)))))
     #+end_src

     #+RESULTS:
     : #'examples.NOC.ch07.wolframca-figures-7-1/draw-rule

     #+begin_src clojure
       (defmethod mouse-event
	 ["Wolframca figures 7_1" :mouse-clicked] [_ _]
	 (draw-rule))
     #+end_src

     #+RESULTS:
     : #multifn[mouse-event 0x3a9569ce]

     #+begin_src clojure
       (draw-rule 29)
     #+end_src

     #+RESULTS:
    
***** Rendering rules
     #+begin_src clojure :tangle ~/PP/Clojure/clojure2d-examples/src/NOC/ch07/wolframca_figures_7_2.clj
       (def cnvs (canvas w h))
       (def window (show-window cnvs "Wolframca figures 7_1"))
       (draw-rule 122)
     #+end_src

     #+begin_src clojure :tangle ~/PP/Clojure/clojure2d-examples/src/NOC/ch07/wolframca_figures_7_2.clj :mkdirp
       (defn renderize-rule [nth-rule]
	 (do
	   (def cnvs (canvas 1000 800))
	   (def window (show-window cnvs (str "rule number " nth-rule)))
	   (draw-rule nth-rule)))
     #+end_src

     #+RESULTS:
     : #'examples.NOC.ch07.wolframca-figures-7-1/renderize-rule

     #+begin_src clojure
 (renderize-rule 331)
     #+end_src
